app/controllers/posts_controller.rb

  def index

    if params[:user]
      @posts = Post.where(user: params[:user]).order("created_at DESC")
    else
       @posts = Post.all.order("created_at DESC")
---
SELECT "posts".* FROM "posts"  ORDER BY created_at DESC

  def show
    @likeds=Like.where(post: @post).all
    @comments=@post.comments.all
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = 1
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]

  def create
    @post = Post.new(post_params)
    @post.user=current_user
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "msg", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)